#include <iostream>
#include <iomanip>

using namespace std;

 void main()
{
    setlocale(LC_ALL, "rus");
    cout << setw(100) << "У лукоморья дуб зелёный \n"
        << setw(100) << "Златая цепь на дубе том :\n"
        << setw(100) << "И днём и ночью кот учёный \n"
        << setw(100) << "Всё ходит по цепи кругом;\n"
        << setw(100) << "Идёт направо - песнь заводит,\n"
        << setw(100) << "Налево - сказку говорит.\n"
        << setw(100) << "Там чудеса : там леший бродит, \n"
        << setw(100) << "Русалка на ветвях сидит; :\n"
        << setw(100) << "Там на неведомых дорожках \n"
        << setw(100) << "Следы невиданных зверей;\n"
        << setw(100) << "Идёт направо - песнь заводит,\n"
        << setw(100) << "Налево - сказку говорит.\n";
}
/* 
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух... там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
*/